In [76]:
import pandas as pd

# Read File to DataFrame
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

In [77]:
# by default, pandas support csv format
df = pd.read_csv('data/friend_list.csv')

In [78]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [79]:
# you can read txt file like this, if the txt file data are comma separated
df = pd.read_csv('data/friend_list.txt')

In [80]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [81]:
# if txt file delimiter is not comma, you can use define delimiter using keyword argument
df = pd.read_csv('data/friend_list_tab.txt', delimiter = "\t")

In [82]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [83]:
# if data file doesn't have header,use header = None, so first column not to be your column header
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [84]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

In [85]:
# you can add column header after you create dataframe
df.columns = ['name', 'age', 'job']

In [86]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [87]:
# you can create column header for no header data at once
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

In [88]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# Create DataFrame
when you want to create dataframe from your python code

## from dictionary

In [89]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [90]:
df.head()

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [91]:
df = df[['name', 'age', 'job']]

In [92]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from OrderedDict

In [93]:
from collections import OrderedDict

In [94]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [95]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from list

In [96]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [97]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [98]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [99]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Write DataFrame to File

In [101]:
df.to_csv('friend_list_from_df.csv')

In [102]:
df.to_csv('friend_list_from_df.txt', sep='\t')

In [104]:
df.to_csv('friend_list_from_df.txt', sep='\t', encoding='utf-8')

Download and Practice Available below,  
https://github.com/minsuk-heo/python_tutorial/blob/master/data_science/pandas/Pandas_Cheatsheet.ipynb